blog/2025/05/data-delta-not-equals-safe/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-21 Wed 22:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>WIP: Data Changes != Safe</title>
<meta name="author" content="kb" />
<meta name="description" content="When are data/config changes actually safe?" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">

<meta name="author" content="Kenny Ballou">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<title>~kb</title>

<link rel="canonical" href="/" />
<link href="/index.xml" rel="alternate" type="application/rss+xml"
      title="~kb/blog" />

<link rel="stylesheet" href="/css/simple.css" />
<link rel="stylesheet" href="/css/simple.add.css" />
<link rel="stylesheet" href="/css/katex.css" />
<link rel="stylesheet" href="/css/all.min.css" />
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://kennyballou.com/blog"> UP </a>
 |
 <a accesskey="H" href="https://kennyballou.com/"> HOME </a>
</div><header id="" class="status">
<nav>
  <a href="/">
    <i class="fade fas fa-home"></i>
  </a>
  <a href="/about.html">
    <i class="fade fas fa-user-circle"></i>
  </a>
  <a href="https://git.sr.ht/~kennyballou/"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade far fa-circle fa-1x"></i>
  </a>
  <a href="https://github.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-github fa-1x"></i>
  </a>
  <a href="https://bitbucket.org/kballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-bitbucket fa-1x"></i>
  </a>
  <a href="https://orcid.org/0000-0002-6032-474X"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-orcid"></i>
  </a>
  <a href="https://linkedin.com/in/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-linkedin-in fa-1x"></i>
  </a>
  <a href="/support.html">
    <i class="fade fas fa-heart fa-1x"></i>
  </a>
  <a href="/cv.pdf"
     target="_blank">
    <i class="fade far fa-file-pdf"></i>
  </a>
  <a href="/B74CC4B41148C3DB364BC21182D94B35744E1B34.asc"
     target="_blank">
    <i class="fade fas fa-key"></i>
  </a>
  <a href="/index.xml" rel="alternate"
     type="application/rss+xml">
    <i class="fade fas fa-rss fa-1x"></i>
  </a>
</nav>
</header>
<div id="main" class="content">
<h1 class="title">WIP: Data Changes != Safe</h1>
<p>
Often in software engineering, during the maintenance of a system, we hear this
rule: "data changes are safer than code changes".
</p>

<p>
Until they aren't.
</p>

<p>
Why do data changes become less "safe" over time?  We adopt this rule so
readily without really considering what it means.  Silently, over time, it
changes the what and how we program a system.  Ultimately, we push more of the
logic of the application into the data itself.  Until the "data" is itself a
programming language!  Except, it's worse.  We did away with schemas and type
checking and just said "it's data, what's the harm?"!
</p>

<p>
To counter, we create tooling, versioning, and additional checks to ensure a
data change doesn't break the system and is readily revertible.  What, oh what
does this sound like?  Oh right, programming.
</p>

<p>
As computer scientists, let's visit our favorite trio: Alice, Bob, and Charlie
in an all too common paraphrasing of these kinds of changes playing out:
</p>

<blockquote>
<p>
Alice, Bob, and Charlie are (vibe) coding, and Bob says, "yo, I'ma push a small
config change to the system."  After reaching in and tweaking the config knob,
Bob yeets off for lunch.  Meanwhile, the system is burning to the ground and
Charlie and Alice are contemplating a simpler life which includes horticulture
or literally anything but this software stuff.
</p>
</blockquote>

<p>
Notice, in this, we are not discussing environmental configuration, the system
below the application necessarily needs configuration, and those configurations
should absolutely be codified in some configuration as code mechanism.
However, the data/configuration changes we <i>are</i> discussing are within the
application.  Recall an application with complex business rules with many
different configuration knobs.  Each of these knobs interact with all the other
knobs and switches in subtle ways but usually surprising ways!
</p>

<p>
For a more concrete example, let's look consider a simple example within a
state management system for a game.  Let's say we have this <code>Goblin</code> struct:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">Goblin</span> {
  <span style="font-weight: bold; text-decoration: underline;">bool</span> <span style="font-weight: bold; font-style: italic;">isAlive</span>;
  <span style="font-weight: bold; text-decoration: underline;">bool</span> <span style="font-weight: bold; font-style: italic;">isAttacking</span>;
  <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">All the other fields ...</span><span style="font-weight: bold; font-style: italic;"> */</span>
}
</pre>
</div>

<p>
Here, we have three expected distinct configurations for instances of this
<code>Goblin</code> struct: Alive and not Attacking; Alive and Attacking; and Dead and Not
Attacking.  However, it's the fourth, supposedly unreachable state that causes
endless annoyance: Dead and Attacking.  At best, guarding against this fourth
state requires a lot of littering of <code>isAlive()</code> checks.
</p>

<p>
Multiply this complexity by each additional boolean variable added to the
<code>Goblin</code> struct.  You might as well add a SAT solve to each frame to keep things
in check.
</p>

<p>
Furthermore, it is not terribly difficult to extrapolate this simple example to
any reasonably complex application.  Business logic encoded as data <b>is</b> a new
programming language, one you likely do not like working with.
</p>

<p>
tl;dr: do not create programming languages out of application data.
</p>
</div>
<footer id="" class="status">
<footer>
  <p>&copy; 2014-2025 Kenny Ballou.
    <a href="http://creativecommons.org/licenses/by-nc-sa/4.0/">Some rights
      reserved.</a></p>
  <p>Powered by <a href="https://gnu.org">GNU/Linux</a></p>
</footer>
</footer>
</body>
</html>
